Returns the boundary conditions type.
  Namespace:   Autodesk.Revit.DB.Structure
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public BoundaryConditionsType GetBoundaryConditionsType()
  Visual Basic
Public Function GetBoundaryConditionsType As BoundaryConditionsType
  Visual C++
public:
BoundaryConditionsType GetBoundaryConditionsType()
 Return Value
 The boundary conditions type.
 See Also
  BoundaryConditions Class
  Autodesk.Revit.DB.Structure Namespace